#include <stdio.h>

// функція MyFunction
// параметр x - передається за значенням (параметр-значення)
// параметр y - передається за адресою
void MyFunction(int x, int* y)
{
	x = 8; // параметр змінюється тільки в межах тіла функції
	*y = 8; // параметр змінюється за межами функції
	return;
}

void main() {
	int a, b;
	a = 5; b = 5;
	printf("a=%d, b=%d\n", a, b);
	// виклик функції MyFunction()
	// параметр a передається за значенням a->x
	// параметр b передається за адресою b->y
	MyFunction(a, &b); // на виході a = 5; b = 8
	printf("a=%d, b=%d\n", a, b);
}